RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_tim.c
    master.MasterOutputTrigger = TIM_TRGO_UPDATE;
#if defined(TIM_MASTERSLAVEMODE_DISABLE)
    master.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
#endif /* defined(TIM_MASTERSLAVEMODE_DISABLE) */
    if (HAL_TIMEx_MasterConfigSynchronization(tim, &master) != HAL_OK)
    {
        LOG_E("TIM trigger master config failed");
        return -RT_ERROR;
    }

    timer_device->trigger_event = CLOCK_TIMER_TRIGGER_EVENT_UPDATE;
    tim->Instance->CR1 &= (~TIM_OPMODE_SINGLE);
    __HAL_TIM_SET_COUNTER(tim, 0);
    __HAL_TIM_CLEAR_FLAG(tim, TIM_FLAG_UPDATE);

    return RT_EOK;
#else
    RT_UNUSED(timer_device);
    RT_UNUSED(prescaler);
    RT_UNUSED(period);
    return -RT_ENOSYS;
#endif /* defined(TIM_TRGO_UPDATE) */
}

/**
 * @brief Configure one STM32 timer as a hardware trigger source.
 * @param timer Pointer to the RT-Thread clock timer device.
 * @param cfg Pointer to the hardware trigger configuration.
 * @return Operation status.
 */
static rt_err_t timer_trigger_config(rt_clock_timer_t *timer, const struct rt_clock_timer_trigger_cfg *cfg)
{
    struct stm32_clock_timer *timer_device;
    rt_uint32_t prescaler;
    rt_uint32_t period;
    rt_err_t result;

    if (cfg->freq_hz == 0U)
    {
        return -RT_EINVAL;
    }

    if (cfg->event != CLOCK_TIMER_TRIGGER_EVENT_UPDATE)
    {
        return -RT_EINVAL;
    }

    timer_device = (struct stm32_clock_timer *)timer;
    if (timer_device->time_device.parent.user_data == RT_NULL)
    {
        return -RT_EINVAL;
    }

    result = timer_trigger_calc(timer, cfg->freq_hz, &prescaler, &period);
    if (result != RT_EOK)
    {
        return result;
    }

    stm32_tim_enable_clock(&timer_device->tim_handle);
    return timer_trigger_update_config(timer_device, prescaler, period);
}

/**
 * @brief Start hardware trigger output on one STM32 timer.
 * @param timer Pointer to the RT-Thread clock timer device.
 * @return Operation status.
 */
static rt_err_t timer_trigger_start(rt_clock_timer_t *timer)
{
    struct stm32_clock_timer *timer_device;
    TIM_HandleTypeDef *tim;

    timer_device = (struct stm32_clock_timer *)timer;
    if (timer_device->time_device.parent.user_data == RT_NULL)
    {
        return -RT_EINVAL;
    }

    tim = &timer_device->tim_handle;
    tim->Instance->CR1 &= (~TIM_OPMODE_SINGLE);
    __HAL_TIM_SET_COUNTER(tim, 0);
    __HAL_TIM_CLEAR_FLAG(tim, TIM_FLAG_UPDATE);

    return (HAL_TIM_Base_Start(tim) == HAL_OK) ? RT_EOK : -RT_ERROR;
}

/**
 * @brief Stop hardware trigger output on one STM32 timer.
 * @param timer Pointer to the RT-Thread clock timer device.
 * @return Operation status.
 */
static rt_err_t timer_trigger_stop(rt_clock_timer_t *timer)
{
    TIM_HandleTypeDef *tim;
    rt_err_t result;

    tim = (TIM_HandleTypeDef *)timer->parent.user_data;
    if (tim == RT_NULL)
    {
        return -RT_EINVAL;
    }

    result = (HAL_TIM_Base_Stop(tim) == HAL_OK) ? RT_EOK : -RT_ERROR;
    __HAL_TIM_CLEAR_FLAG(tim, TIM_FLAG_UPDATE);
    __HAL_TIM_SET_COUNTER(tim, 0);

    return result;
}

/**
 * @brief Release and deinitialize hardware trigger output on one STM32 timer.
 * @param timer Pointer to the RT-Thread clock timer device.
 * @return Operation status.
 * @note Timer trigger sources are dedicated to trigger output. Releasing a
 *       trigger source stops the timer, clears the trigger output when the HAL
 *       exposes a reset selector, and deinitializes the HAL TIM base state. It
 *       does not unregister the RT-Thread timer device object.
 */
static rt_err_t timer_trigger_release(rt_clock_timer_t *timer)
{
    struct stm32_clock_timer *timer_device;
    TIM_HandleTypeDef *tim;
    rt_err_t result = RT_EOK;

    timer_device = (struct stm32_clock_timer *)timer;
    if (timer_device->time_device.parent.user_data == RT_NULL)
    {
        return -RT_EINVAL;
    }

    tim = &timer_device->tim_handle;

    if (timer_trigger_stop(timer) != RT_EOK)
    {
        result = -RT_ERROR;
    }

#if defined(TIM_TRGO_RESET)
    TIM_MasterConfigTypeDef master = {0};
    master.MasterOutputTrigger = TIM_TRGO_RESET;
#if defined(TIM_MASTERSLAVEMODE_DISABLE)
    master.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
#endif /* defined(TIM_MASTERSLAVEMODE_DISABLE) */
    if (HAL_TIMEx_MasterConfigSynchronization(tim, &master) != HAL_OK)
    {
        result = -RT_ERROR;
    }
#endif /* defined(TIM_TRGO_RESET) */

    if (HAL_TIM_Base_DeInit(tim) != HAL_OK)
    {
        result = -RT_ERROR;
    }

    timer_device->trigger_event = CLOCK_TIMER_TRIGGER_EVENT_UPDATE;
    return result;
}

#endif /* defined(RT_USING_CLOCK_TIMER_TRIGGER) */

static rt_err_t timer_ctrl(rt_clock_timer_t *timer, rt_uint32_t cmd, void *arg)
{
    TIM_HandleTypeDef *tim = RT_NULL;
    rt_err_t result = -RT_ERROR;
    uint32_t pclk1_doubler, pclk2_doubler;

    RT_ASSERT(timer != RT_NULL);

    tim = (TIM_HandleTypeDef *)timer->parent.user_data;

    switch (cmd)
    {
    case CLOCK_TIMER_CTRL_FREQ_SET:
    {
        rt_uint32_t freq;
        rt_uint16_t val=0;

        if (arg == RT_NULL)
        {
            result = -RT_EINVAL;
            break;
        }

        /* set timer frequence */
        freq = *((rt_uint32_t *)arg);

        stm32_tim_pclkx_doubler_get(&pclk1_doubler, &pclk2_doubler);

#if defined(SOC_SERIES_STM32F2) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32F7)
        if (0
#ifdef TIM1
        || tim->Instance == TIM1
#endif /* TIM1 */
#ifdef TIM8
        || tim->Instance == TIM8
#endif /* TIM8 */
#ifdef TIM9
        || tim->Instance == TIM9
#endif /* TIM9 */
#ifdef TIM10
        || tim->Instance == TIM10
#endif /* TIM10 */
#ifdef TIM11
        || tim->Instance == TIM11
#endif /* TIM11 */
        )
#elif defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32G4)
        if (0
#ifdef TIM15
        || tim->Instance == TIM15
#endif /* TIM15 */
#ifdef TIM16
        || tim->Instance == TIM16
#endif /* TIM16 */
#ifdef TIM17
        || tim->Instance == TIM17
#endif /* TIM17 */
        )
#elif defined(SOC_SERIES_STM32WB)
        if (0
#ifdef TIM16
        || tim->Instance == TIM16
#endif /* TIM16 */
#ifdef TIM17
        || tim->Instance == TIM17
#endif /* TIM17 */
        )
#elif defined(SOC_SERIES_STM32MP1)
        if(0
#ifdef TIM14
        || tim->Instance == TIM14
#endif /* TIM14 */
#ifdef TIM16
        || tim->Instance == TIM16
#endif /* TIM16 */
#ifdef TIM17
        || tim->Instance == TIM17
#endif /* TIM17 */
        )
#elif defined(SOC_SERIES_STM32F1) || defined(SOC_SERIES_STM32F0) || defined(SOC_SERIES_STM32G0) || defined(SOC_SERIES_STM32H7)
        if (0)
#else
#error "This driver has not supported this series yet!"
#endif /* defined(SOC_SERIES_STM32F2) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32F7) */
        {
#if !defined(SOC_SERIES_STM32F0) && !defined(SOC_SERIES_STM32G0)
            val = HAL_RCC_GetPCLK2Freq() * pclk2_doubler / freq;
#endif /* !defined(SOC_SERIES_STM32F0) && !defined(SOC_SERIES_STM32G0) */
        }
        else
        {
            val = HAL_RCC_GetPCLK1Freq() * pclk1_doubler / freq;
        }
        __HAL_TIM_SET_PRESCALER(tim, val - 1);

        /* Update frequency value */
        tim->Instance->EGR |= TIM_EVENTSOURCE_UPDATE;

